#+TITLE:     Org Bash Utils
#+AUTHOR:    Osiris Alejandro Gómez
#+EMAIL:     osiux@osiux.com
#+LANGUAGE:  en
#+LINK:      ISSUE https://github.com/osiris/org-bash-utils/issues/




** Releases
*** Release 0.1 [2/2]
**** DONE publish actual version of scripts
     CLOSED: [2014-03-11 mar 10:56] SCHEDULED: <2014-03-11 mar>
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2014-03-11 mar 10:56]
     CLOCK: [2014-03-11 mar 10:30]--[2014-03-11 mar 10:55] =>  0:25
     :END:

**** DONE add =org-year=
     CLOSED: [2014-03-11 mar 12:46]
     :LOGBOOK:
     - State "DONE"       from "NEXT"       [2014-03-11 mar 12:46]
     CLOCK: [2014-03-11 mar 12:10]--[2014-03-11 mar 12:45] =>  0:35
     :END:

     - Like =org-clock= but show complete year

**** add examples [2/2]
***** DONE =org-timeline= full year
      CLOSED: [2014-03-11 mar 12:57]
      :LOGBOOK:
      - State "DONE"       from "NEXT"       [2014-03-11 mar 12:57]
      :END:

***** DONEq =org-status=
      CLOSED: [2014-03-11 mar 13:01]
      :LOGBOOK:
      - State "DONE"       from "NEXT"       [2014-03-11 mar 13:01]
      CLOCK: [2014-03-11 mar 12:45]--[2014-03-11 mar 12:57] =>  0:12
      :END:

*** TODO Release 0.2

** Bugs [1/3]
*** NEXT =BAR= is empty when second timestamp is greater than first timestamp
*** NEXT [[ISSUE:1]] Work in the current directory

    - [ ] replace harcode dir =~/org= for =$ORG_DIR= variable
    - [ ] set default directory current directory using =$PWD= variable
    - [ ] add =-dir= variable for run in specific directory

*** DONE [[ISSUE:2]] How to use your commands from anywhere?
    CLOSED: [2014-03-12 mié 15:08]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2014-03-12 mié 15:08]
    CLOCK: [2014-03-12 mié 14:58]--[2014-03-12 mié 15:05] =>  0:07
    :END:

    - [X] add a *setup* section in =README.org=

** Features [1/4]
*** NEXT don't show empty hours columns
*** NEXT add proyect filter to =org-clock= and =org-year=
*** NEXT verify negative results in =org-timeline=
*** DONE add second parameter for grep filename =org-clock=
    CLOSED: [2014-03-18 mar 08:55]
    :LOGBOOK:
    - State "DONE"       from "NEXT"       [2014-03-18 mar 08:55]
    CLOCK: [2014-03-18 mar 08:46]--[2014-03-18 mar 08:54] =>  0:08
    :END:


*** NEXT drafts =org-habits= 
    :LOGBOOK:
    CLOCK: [2014-03-18 mar 09:07]--[2014-03-18 mar 09:32] =>  0:25
    :END:

    | 01 | 02 | 03 | 04 | 05 | 06 | 07 | 08 | 09 | 10 | 11 | 12 | 13 | 14 | 15 | 16 |  17 | 18 | 19 | 20 | 21 | 22 | 23 | 24 | 25 | 26 | 27 | 28 |
    |----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+-----+----+----+----+----+----+----+----+----+----+----+----|
    |  □ |  □ |  □ |  ▣ |  □ |  ▣ |  ▣ |  □ |  □ |  ▣ |  □ |  □ |  ▣ |  ▣ |  □ |  □ |   ▣ |  ▣ |  □ |  □ |  □ |  □ |  □ |  ▣ |  ▣ |  □ |  □ |  ▣ |
    |----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+----+-----+----+----+----+----+----+----+----+----+----+----+----|
    |    |    |    | 38 |    | 40 | 66 |    |    | 48 |    |    | 53 | 60 |    |    | 180 | 84 |    |    |    |    |    | 49 | 60 |    |    | 31 |

** README
*** DONE add example of =org-clock= for second parameter
    CLOSED: [2014-03-18 mar 09:06]
    :LOGBOOK:
    - State "DONE"       from ""           [2014-03-18 mar 09:06]
    CLOCK: [2014-03-18 mar 09:00]--[2014-03-18 mar 09:06] =>  0:06
    :END:

